; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_7)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)

    (HasAngle angle320 link1)
    (HasAngle angle260 link2)
    (HasAngle angle300 link3)
    (HasAngle angle20 link4)
    (HasAngle angle80 link5)
    (HasAngle angle100 link6)
    (HasAngle angle20 link7)
    (HasAngle angle120 link8)
    (HasAngle angle100 link9)
    (HasAngle angle60 link10)
)
(:goal
(and
    (HasAngle angle160 link1)
    (HasAngle angle120 link2)
    (HasAngle angle200 link3)
    (HasAngle angle0 link4)
    (HasAngle angle40 link5)
    (HasAngle angle100 link6)
    (HasAngle angle40 link7)
    (HasAngle angle140 link8)
    (HasAngle angle0 link9)
    (HasAngle angle240 link10)
    )
)
)

; plan
1. (decrease_angle link1 angle320 angle300)
   deleted: (hasangle angle320 link1) (hasangle angle260 link2) (hasangle angle300 link3) (hasangle angle20 link4) (hasangle angle80 link5) (hasangle angle100 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle100 link9) (hasangle angle60 link10)
   added: (hasangle angle300 link1) (hasangle angle240 link2) (hasangle angle280 link3) (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle80 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   goals met: 1 of 10
2. (decrease_angle link1 angle300 angle280)
   deleted: (hasangle angle300 link1) (hasangle angle240 link2) (hasangle angle280 link3) (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle80 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   added: (hasangle angle280 link1) (hasangle angle220 link2) (hasangle angle260 link3) (hasangle angle340 link4) (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle340 link7) (hasangle angle80 link8) (hasangle angle60 link9) (hasangle angle20 link10)
   goals met: 1 of 10
3. (decrease_angle link1 angle280 angle260)
   deleted: (hasangle angle280 link1) (hasangle angle220 link2) (hasangle angle260 link3) (hasangle angle340 link4) (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle340 link7) (hasangle angle80 link8) (hasangle angle60 link9) (hasangle angle20 link10)
   added: (hasangle angle260 link1) (hasangle angle200 link2) (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle320 link7) (hasangle angle60 link8) (hasangle angle40 link9) (hasangle angle0 link10)
   goals met: 0 of 10
4. (decrease_angle link1 angle260 angle240)
   deleted: (hasangle angle260 link1) (hasangle angle200 link2) (hasangle angle240 link3) (hasangle angle320 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle320 link7) (hasangle angle60 link8) (hasangle angle40 link9) (hasangle angle0 link10)
   added: (hasangle angle240 link1) (hasangle angle180 link2) (hasangle angle220 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle20 link6) (hasangle angle300 link7) (hasangle angle40 link8) (hasangle angle20 link9) (hasangle angle340 link10)
   goals met: 0 of 10
5. (decrease_angle link1 angle240 angle220)
   deleted: (hasangle angle240 link1) (hasangle angle180 link2) (hasangle angle220 link3) (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle20 link6) (hasangle angle300 link7) (hasangle angle40 link8) (hasangle angle20 link9) (hasangle angle340 link10)
   added: (hasangle angle220 link1) (hasangle angle160 link2) (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle340 link5) (hasangle angle0 link6) (hasangle angle280 link7) (hasangle angle20 link8) (hasangle angle0 link9) (hasangle angle320 link10)
   goals met: 2 of 10
6. (decrease_angle link1 angle220 angle200)
   deleted: (hasangle angle220 link1) (hasangle angle160 link2) (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle340 link5) (hasangle angle0 link6) (hasangle angle280 link7) (hasangle angle20 link8) (hasangle angle0 link9) (hasangle angle320 link10)
   added: (hasangle angle200 link1) (hasangle angle140 link2) (hasangle angle180 link3) (hasangle angle260 link4) (hasangle angle320 link5) (hasangle angle340 link6) (hasangle angle260 link7) (hasangle angle0 link8) (hasangle angle340 link9) (hasangle angle300 link10)
   goals met: 0 of 10
7. (decrease_angle link1 angle200 angle180)
   deleted: (hasangle angle200 link1) (hasangle angle140 link2) (hasangle angle180 link3) (hasangle angle260 link4) (hasangle angle320 link5) (hasangle angle340 link6) (hasangle angle260 link7) (hasangle angle0 link8) (hasangle angle340 link9) (hasangle angle300 link10)
   added: (hasangle angle180 link1) (hasangle angle120 link2) (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle320 link6) (hasangle angle240 link7) (hasangle angle340 link8) (hasangle angle320 link9) (hasangle angle280 link10)
   goals met: 1 of 10
8. (decrease_angle link1 angle180 angle160)
   deleted: (hasangle angle180 link1) (hasangle angle120 link2) (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle320 link6) (hasangle angle240 link7) (hasangle angle340 link8) (hasangle angle320 link9) (hasangle angle280 link10)
   added: (hasangle angle160 link1) (hasangle angle100 link2) (hasangle angle140 link3) (hasangle angle220 link4) (hasangle angle280 link5) (hasangle angle300 link6) (hasangle angle220 link7) (hasangle angle320 link8) (hasangle angle300 link9) (hasangle angle260 link10)
   goals met: 1 of 10
9. (increase_angle link2 angle100 angle120)
   deleted: (hasangle angle100 link2) (hasangle angle140 link3) (hasangle angle220 link4) (hasangle angle280 link5) (hasangle angle300 link6) (hasangle angle220 link7) (hasangle angle320 link8) (hasangle angle300 link9) (hasangle angle260 link10)
   added: (hasangle angle120 link2) (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle320 link6) (hasangle angle240 link7) (hasangle angle340 link8) (hasangle angle320 link9) (hasangle angle280 link10)
   goals met: 2 of 10
10. (increase_angle link3 angle160 angle180)
   deleted: (hasangle angle160 link3) (hasangle angle240 link4) (hasangle angle300 link5) (hasangle angle320 link6) (hasangle angle240 link7) (hasangle angle340 link8) (hasangle angle320 link9) (hasangle angle280 link10)
   added: (hasangle angle180 link3) (hasangle angle260 link4) (hasangle angle320 link5) (hasangle angle340 link6) (hasangle angle260 link7) (hasangle angle0 link8) (hasangle angle340 link9) (hasangle angle300 link10)
   goals met: 2 of 10
11. (increase_angle link3 angle180 angle200)
   deleted: (hasangle angle180 link3) (hasangle angle260 link4) (hasangle angle320 link5) (hasangle angle340 link6) (hasangle angle260 link7) (hasangle angle0 link8) (hasangle angle340 link9) (hasangle angle300 link10)
   added: (hasangle angle200 link3) (hasangle angle280 link4) (hasangle angle340 link5) (hasangle angle0 link6) (hasangle angle280 link7) (hasangle angle20 link8) (hasangle angle0 link9) (hasangle angle320 link10)
   goals met: 4 of 10
12. (increase_angle link4 angle280 angle300)
   deleted: (hasangle angle280 link4) (hasangle angle340 link5) (hasangle angle0 link6) (hasangle angle280 link7) (hasangle angle20 link8) (hasangle angle0 link9) (hasangle angle320 link10)
   added: (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle20 link6) (hasangle angle300 link7) (hasangle angle40 link8) (hasangle angle20 link9) (hasangle angle340 link10)
   goals met: 3 of 10
13. (increase_angle link4 angle300 angle320)
   deleted: (hasangle angle300 link4) (hasangle angle0 link5) (hasangle angle20 link6) (hasangle angle300 link7) (hasangle angle40 link8) (hasangle angle20 link9) (hasangle angle340 link10)
   added: (hasangle angle320 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle320 link7) (hasangle angle60 link8) (hasangle angle40 link9) (hasangle angle0 link10)
   goals met: 3 of 10
14. (increase_angle link4 angle320 angle340)
   deleted: (hasangle angle320 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle320 link7) (hasangle angle60 link8) (hasangle angle40 link9) (hasangle angle0 link10)
   added: (hasangle angle340 link4) (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle340 link7) (hasangle angle80 link8) (hasangle angle60 link9) (hasangle angle20 link10)
   goals met: 4 of 10
15. (increase_angle link4 angle340 angle0)
   deleted: (hasangle angle340 link4) (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle340 link7) (hasangle angle80 link8) (hasangle angle60 link9) (hasangle angle20 link10)
   added: (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle80 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   goals met: 4 of 10
16. (decrease_angle link5 angle60 angle40)
   deleted: (hasangle angle60 link5) (hasangle angle80 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   added: (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle340 link7) (hasangle angle80 link8) (hasangle angle60 link9) (hasangle angle20 link10)
   goals met: 5 of 10
17. (increase_angle link6 angle60 angle80)
   deleted: (hasangle angle60 link6) (hasangle angle340 link7) (hasangle angle80 link8) (hasangle angle60 link9) (hasangle angle20 link10)
   added: (hasangle angle80 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   goals met: 5 of 10
18. (increase_angle link6 angle80 angle100)
   deleted: (hasangle angle80 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   added: (hasangle angle100 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle100 link9) (hasangle angle60 link10)
   goals met: 6 of 10
19. (decrease_angle link7 angle20 angle0)
   deleted: (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle100 link9) (hasangle angle60 link10)
   added: (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   goals met: 6 of 10
20. (increase_angle link4 angle0 angle20)
   deleted: (hasangle angle0 link4) (hasangle angle40 link5) (hasangle angle100 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle80 link9) (hasangle angle40 link10)
   added: (hasangle angle20 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle100 link9) (hasangle angle60 link10)
   goals met: 3 of 10
21. (increase_angle link4 angle20 angle40)
   deleted: (hasangle angle20 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle100 link9) (hasangle angle60 link10)
   added: (hasangle angle40 link4) (hasangle angle80 link5) (hasangle angle140 link6) (hasangle angle40 link7) (hasangle angle140 link8) (hasangle angle120 link9) (hasangle angle80 link10)
   goals met: 5 of 10
22. (decrease_angle link9 angle120 angle100)
   deleted: (hasangle angle120 link9) (hasangle angle80 link10)
   added: (hasangle angle100 link9) (hasangle angle60 link10)
   goals met: 5 of 10
23. (decrease_angle link9 angle100 angle80)
   deleted: (hasangle angle100 link9) (hasangle angle60 link10)
   added: (hasangle angle80 link9) (hasangle angle40 link10)
   goals met: 5 of 10
24. (decrease_angle link9 angle80 angle60)
   deleted: (hasangle angle80 link9) (hasangle angle40 link10)
   added: (hasangle angle60 link9) (hasangle angle20 link10)
   goals met: 5 of 10
25. (decrease_angle link9 angle60 angle40)
   deleted: (hasangle angle60 link9) (hasangle angle20 link10)
   added: (hasangle angle40 link9) (hasangle angle0 link10)
   goals met: 5 of 10
26. (decrease_angle link9 angle40 angle20)
   deleted: (hasangle angle40 link9) (hasangle angle0 link10)
   added: (hasangle angle20 link9) (hasangle angle340 link10)
   goals met: 5 of 10
27. (decrease_angle link9 angle20 angle0)
   deleted: (hasangle angle20 link9) (hasangle angle340 link10)
   added: (hasangle angle0 link9) (hasangle angle320 link10)
   goals met: 6 of 10
28. (decrease_angle link10 angle320 angle300)
   deleted: (hasangle angle320 link10)
   added: (hasangle angle300 link10)
   goals met: 6 of 10
29. (decrease_angle link10 angle300 angle280)
   deleted: (hasangle angle300 link10)
   added: (hasangle angle280 link10)
   goals met: 6 of 10
30. (decrease_angle link10 angle280 angle260)
   deleted: (hasangle angle280 link10)
   added: (hasangle angle260 link10)
   goals met: 6 of 10
31. (decrease_angle link7 angle40 angle20)
   deleted: (hasangle angle40 link7) (hasangle angle140 link8) (hasangle angle0 link9) (hasangle angle260 link10)
   added: (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle240 link10)
   goals met: 4 of 10
32. (decrease_angle link4 angle40 angle20)
   deleted: (hasangle angle40 link4) (hasangle angle80 link5) (hasangle angle140 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle240 link10)
   added: (hasangle angle20 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle320 link9) (hasangle angle220 link10)
   goals met: 3 of 10
33. (increase_angle link5 angle60 angle80)
   deleted: (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle320 link9) (hasangle angle220 link10)
   added: (hasangle angle80 link5) (hasangle angle140 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle240 link10)
   goals met: 4 of 10
34. (increase_angle link7 angle20 angle40)
   deleted: (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle240 link10)
   added: (hasangle angle40 link7) (hasangle angle140 link8) (hasangle angle0 link9) (hasangle angle260 link10)
   goals met: 6 of 10
35. (decrease_angle link10 angle260 angle240)
   deleted: (hasangle angle260 link10)
   added: (hasangle angle240 link10)
   goals met: 7 of 10
36. (decrease_angle link4 angle20 angle0)
   deleted: (hasangle angle20 link4) (hasangle angle80 link5) (hasangle angle140 link6) (hasangle angle40 link7) (hasangle angle140 link8) (hasangle angle0 link9) (hasangle angle240 link10)
   added: (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle220 link10)
   goals met: 4 of 10
37. (decrease_angle link5 angle60 angle40)
   deleted: (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle220 link10)
   added: (hasangle angle40 link5) (hasangle angle100 link6) (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle320 link9) (hasangle angle200 link10)
   goals met: 6 of 10
38. (increase_angle link7 angle0 angle20)
   deleted: (hasangle angle0 link7) (hasangle angle100 link8) (hasangle angle320 link9) (hasangle angle200 link10)
   added: (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle220 link10)
   goals met: 6 of 10
39. (increase_angle link7 angle20 angle40)
   deleted: (hasangle angle20 link7) (hasangle angle120 link8) (hasangle angle340 link9) (hasangle angle220 link10)
   added: (hasangle angle40 link7) (hasangle angle140 link8) (hasangle angle0 link9) (hasangle angle240 link10)
   goals met: 10 of 10
